#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-7wiNAAxmXYC2d33d

Waiting for the plan to start...

Terraform v1.8.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.quarkus_easy_retrofit will be created
  + resource "github_repository" "quarkus_easy_retrofit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A cool description"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://some-url/"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-easy-retrofit"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "quarkus-extension",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_team.quarkus_easy_retrofit will be created
  + resource "github_team" "quarkus_easy_retrofit" {
      + create_default_maintainer = false
      + description               = "easy-retrofit team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-easy-retrofit"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_easy_retrofit["liuziyuan"] will be created
  + resource "github_team_membership" "quarkus_easy_retrofit" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "liuziyuan"
    }

  # github_team_repository.quarkus_easy_retrofit will be created
  + resource "github_team_repository" "quarkus_easy_retrofit" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-easy-retrofit"
      + team_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*